{
    "basics": {
      "name": "Mohammed Sheikh",
      "label": "Full Stack Developer",
      "picture": "",
      "email": "mohammedsheikh29@gmail.com",
      "phone": "(425) 553 5202",
      "website": "",
      "summary": "Employ my programming, analytical and logical skills to build software products that impact the world.",
      "location": {
        "address": "14707 NE 36th St",
        "postalCode": "WA 98007",
        "city": "Seattle",
        "countryCode": "US",
        "region": "Washington"
      },
      "profiles": [{
        "network": "LinkedIn",
        "username": "Mohammed Sheikh",
        "url": "https://www.linkedin.com/in/mohammed-sheikh-4a44b1106/"
      }]
    },
  "work": [
    {
      "company": "Tata Consultancy Services",
      "position": "Sr. SDE/Dev lead",
      "website": "http://www.tcs.com",
      "startDate": "2020-11-01",
      "summary": "Microsoft Teams Developer platform lets you build custom applications on teams. This project involved solving specific customer problem using various Teams capabilities - Tabs, Messaging Extensions, Bots, Task Modules and Connectors.",
      "highlights": [
        "Architected multiple solutions on Teams platform using Azure services and office 365 developement.",
        "Closely interacted with customer to understand and solve specific requirement and problem statement.",
        "Managed a team of developers for code quality, maintainability and extensibility.",
        "Delivered multiple quick solutions in tight timelines ensuring good quality."
      ]
    },
    {
      "company": "Tata Consultancy Services",
      "position": "Sr. SDE",
      "website": "http://www.tcs.com",
      "startDate": "2019-07-01",
      "endDate": "2020-10-31",
      "summary": "Microsoft Services Supplier Management is one place for searching and selecting appropriate supplier filtering through 1000s of skills, industry, domains and other supplier categories. It also lets you validate suppliers based on past projects and allows suppliers to enter details about themselves. The site gives visualization of each supplier to enable better decision making for stakeholders.",
      "highlights": [
        "Re-architectured the project to enable move to modern SharePoint framework.",
        "Built connections to new upstream database systems and modeled the data for effective searchability.",
        "Updated the front-end by building scalable and reusable react components. ",
        "Fixed Security vulnerabilities and helped build a more robust architecture.",
        "Support for responsive design to be used on all browsers and devices."
      ]
    },
    {
      "company": "Tata Consultancy Services",
      "position": "Sr. SDE",
      "website": "http://www.tcs.com",
      "startDate": "2017-02-01",
      "endDate": "2019-06-30",
      "summary": "Microsoft Learning Portal (Infopedia) is a wiki-like knowledge delivery platform for sales and Marketing department of Microsoft. The portal is one stop location for over 150,000 items which consists of Documents, Pages, Books, Videos, Training Materials etc.",
      "highlights": [
        "Built end to end search experience used to find learning content.",
        "Created a configurable model to quickly extend or modify search capabilities like search suggestions, filters, sorts, domains etc.",
        "Effective communication with stake holders to come up with efficient and quick solutions.",
        "Helped improve results with collaborating on user experience study, analytics and reporting.",
        "Support for responsive design to be used on all browsers and devices.",
        "Created content sync jobs to integrate content from external systems into SharePoint environment."
      ]
    },
    {
      "company": "Tata Consultancy Services",
      "position": "Application Security Analyst",
      "website": "http://www.tcs.com",
      "startDate": "2016-01-01",
      "endDate": "2017-01-01",
      "summary": "Responsible for Application Security Review, Assessment of Microsoft IT Applications and enabling compliance to application Security guidelines",
      "highlights": [
        "Security design review of new applications.",
        "Collaborate with developement teams with respect to application security in various stages of application life cycle.",
        "Static code analysis and finding vulnerabilities",
        "Suggest security fixes and best practices in accordance with industry standards."
      ]
    },
    {
      "company": "Tata Consultancy Services",
      "position": "Project Lead/ Sr SDE",
      "website": "http://www.tcs.com",
      "startDate": "2014-05-01",
      "endDate": "2016-01-01",
      "summary": "Sports Data API is a one stop solution for providing sports data to different Microsoft platforms like PRIME, Windows App, Windows Phone App, Bing, Xbox etc. Data is collected from multiple providers like STATS, Opta, Perform, Infoplum etc and provided to consumers in a unified format.",
      "highlights": [
        "Built 'ingesters' for ingesting data from new content providers.",
        "Enabled team of developers with code structure, maintainence and quality.",
        "Help prioritize and streamline work items.",
        "Help team members make technical decisions and problem solving.",
        "Ensure effective and bug free delivery within timelines."
      ]
    },
    {
      "company": "Tata Consultancy Services",
      "position": "SDE/Module Lead",
      "website": "http://www.tcs.com",
      "startDate": "2014-02-01",
      "endDate": "2014-05-01",
      "summary": "Prime is the re-envisioning and consolidation of MSN to serve as the web presence for the combined product lines across Microsoft media products. Prime will consolidate and evolve both 'Classic' and TMX versions of MSN into single web product on a common codebase in all markets with a common feature-set and design. ",
      "highlights": [
        "Implemented Skyline feature on various MSN Sports home pages.",
        "Created abstract feature design so that same feature can be extended for multiple sports.",
        "Ensured high quality delivery with unit tests and automation tests.",
        "Helped improve performance of data fetch requests."
      ]
    },
    {
      "company": "Tata Consultancy Services",
      "position": "SDE/On-Site Coordinator",
      "website": "http://www.tcs.com",
      "startDate": "2013-02-01",
      "endDate": "2014-01-01",
      "summary": "MSN Live Play Football Match Centre focuses on an iterative approach to releasing a full match centre for MSN using data from providers",
      "highlights": [
        "Implemented Summary, Timeline and Live Commentary Module.",
        "Worked closely with Client at onshore location Dublin to analyze the requirements and address potential gaps.",
        "Communicated finished requirement and solution architecture to the offshore team in Pune.",
        "Felicitated effective and bug free delivery within timelines."
      ]
    },
    {
      "company": "Tata Consultancy Services",
      "position": "SDE/Team Member/Scrum Master",
      "website": "http://www.tcs.com",
      "startDate": "2012-03-01",
      "endDate": "2013-01-01",
      "summary": "Content Ingestion System takes the feed from different providers and injects them in the format compatible to MSN systems.",
      "highlights": [
        "Created content ingestion 'callouts' which involved data read, manipulation and ingestion.",
        "Ensured job scheduling, testing and bug fixing of ingestion."
      ]
    },
    {
      "company": "Tata Consultancy Services",
      "position": "SDET/Team Member",
      "website": "http://www.tcs.com",
      "startDate": "2010-02-01",
      "endDate": "2012-02-01",
      "summary": "Test SDK is an automation framework architecture on top of popular browser automation frameworks like Selenium and WebAii, This would help write automated functional tests for testing web pages on MSN site.",
      "highlights": [
        "Created automated test cases using browser automation framework (Selenium and Web AII",
        "Created and executed test plans.",
        "Performed unit testing, acceptance testings, regression and integration."
      ]
    }
  ],
    "education": [{
      "institution": "Mumbai University",
      "area": "Engineering (Electronics)",
      "studyType": "Bachelor",
      "startDate": "2009-05-01",
      "endDate": "2005-07-01",
      "gpa": "4.0"
    }],      
    "publications": [{
      "name": "PC Control by Speech Recognition",
      "publisher": "Mumbai University",
      "releaseDate": "2009-04-01",
      "summary": "Aim of project is to authenticate speaker’s identity by user’s voice and execute simple PC commands like open a text file. In order to authenticate speaker’s identity real time speech signal is compared with the pre-recorded user’s voice signals in the database. Here the sampled signal’s power spectrum density is compared with power spectrum density of the pre-recorded voice using MATLAB and on successful match the name of the particular speaker is displayed. The possible application of this project could to operate personalized digital gadgets with voice commands. Speaker Recognition - the ability of the computer to understand the spoken words for the purpose receiving commands and data input from the speaker."
    }],
    "skills": [{
      "name": "Frontend Development",
      "level": "Advanced",
      "keywords": [
        "HTML",
        "CSS",
        "Javascript",
        "JQuery",
        "Angular",
        "ReactJS",
        "TypeScript"
      ]
    },
    {
      "name": "Backend Development",
      "level": "Advanced",
      "keywords": [
        "C#",
        "ASP.NET MVC",
        "Web API",        
        ".Net Core",
        "Entity Framework 6",
        "Microsoft Bot Framework",
        "Microsoft Graph API",
        "Teams App Developement"
      ]
    },    
    {
      "name": "Cloud Services",
      "level": "Intermediate",
      "keywords": [
        "Microsoft Azure",
        "Azure App Service",
        "Search",
        "Functions",
        "Services Bus",
        "API Management",
        "Hybrid Connections",
        "Azure Active Directory"
      ]
    },
    {
      "name": "System Design",
      "level": "Intermediate",
      "keywords": [
        "OOPs",
        "SOLID",
        "Distributed Systems"      
      ]
    },
    {
      "name": "Test Automation",
      "level": "Intermediate",
      "keywords": [
        "Selenium",
        "Web AII"        
      ]
    },{
      "name": "Application Security",
      "level": "Intermediate",
      "keywords": [
        "Penetration Testing",
        "Static Code Analysis"        
      ]
    },
    {
      "name": "Database",
      "level": "Intermediate",
      "keywords": [
        "LINQ",
        "SQL Server",
        "Azure DocumentDB"
      ]
    }    
  ],
    "languages": [{
      "language": "English",
      "fluency": "Fluent"
    },
    {
      "language": "Hindi",
      "fluency": "Native Speaker"
    },
    {
      "language": "Gujarati",
      "fluency": "Native Speaker"
    }],
    "interests": [],    
    "meta": {
        "theme": "stackoverflow"
    }
  }
